In [29]: modelsummary = model.summary()
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
audio (InputLayer)              (None, 220500)       0                                            
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 1, 220500)    0           audio[0][0]                      
__________________________________________________________________________________________________
melspectrogram_1 (Melspectrogra (None, 64, 431, 1)   0           lambda_1[0][0]                   
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 431, 64, 1)   0           melspectrogram_1[0][0]           
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 431, 64, 64)  576         lambda_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 431, 64, 64)  256         conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 431, 64, 64)  0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 431, 64, 96)  55392       activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 431, 64, 96)  384         conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 431, 64, 96)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 431, 64, 96)  0           activation_2[0][0]               
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 431, 64, 96)  83040       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 431, 64, 96)  384         conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 431, 64, 96)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 216, 64, 96)  0           activation_3[0][0]               
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 216, 32, 96)  0           average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 216, 32, 128) 110720      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 216, 32, 128) 512         conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 216, 32, 128) 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 216, 32, 128) 0           activation_4[0][0]               
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 216, 32, 128) 147584      max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 216, 32, 128) 512         conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 216, 32, 128) 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 108, 32, 128) 0           activation_5[0][0]               
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 108, 16, 128) 0           average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 108, 16, 256) 295168      max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 108, 16, 256) 1024        conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 108, 16, 256) 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 108, 16, 256) 0           activation_6[0][0]               
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 108, 16, 256) 590080      max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 108, 16, 256) 1024        conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 108, 16, 256) 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
average_pooling2d_3 (AveragePoo (None, 54, 16, 256)  0           activation_7[0][0]               
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 54, 8, 256)   0           average_pooling2d_3[0][0]        
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 54, 8, 512)   1180160     max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 54, 8, 512)   2048        conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 54, 8, 512)   0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 54, 8, 512)   2359808     activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 54, 8, 512)   2048        conv2d_9[0][0]                   
__________________________________________________________________________________________________
global_feat (InputLayer)        (None, 128, 12)      0                                            
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 54, 8, 512)   0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 128, 12)      48          global_feat[0][0]                
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 54, 4, 1024)  0           activation_9[0][0]               
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 128, 128)     109056      batch_normalization_1[0][0]      
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 4, 1024)      0           lambda_3[0][0]                   
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 128, 128)     198144      bidirectional_1[0][0]            
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 1024)         0           lambda_4[0][0]                   
__________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalM (None, 128)          0           bidirectional_2[0][0]            
__________________________________________________________________________________________________
other (InputLayer)              (None, 1)            0                                            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1153)         0           lambda_5[0][0]                   
                                                                 global_max_pooling1d_1[0][0]     
                                                                 other[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 80)           92320       concatenate_1[0][0]              
==================================================================================================
Total params: 5,230,288
Trainable params: 5,226,168
Non-trainable params: 4,120
__________________________________________________________________________________________________

